In [1]:
import pandas as pd

In [2]:
# --- Reading a CSV into a DataFrame ---
df = pd.read_json('json/books.json')
# --- Viewing column labels ---
list(df.columns)

['name', 'author', 'ISBN', 'No. pages']

In [3]:
df

           name               author       ISBN  No. pages
0        Hamlet  William Shakespeare  141396504        400
1  Oliver Twist      Charles Dickens  141439742        608
2    Tom Sawyer           Mark Twain  486400778        192